quest_system_1406345691_name=^?^Bogis' Problem
quest_system_1406345691_stage_0=^?^Gain the protection of Squelch for Bogis.
quest_system_1406345691_stage_1=^?^Squelch has given you his flag, so that you may hoist it on Bogis' castle.
quest_system_1406345691_stage_2=^?^Explain the situation to Bagaba.<br>Remove Squelch's flag and hoist the flag of His Majesty, King Mark!
quest_system_1406345691_stage_3=^?^Speak to Bogis. Remove Bagaba's flag and hoist the flag of His Majesty, King Mark!
quest_system_1406345691_task=^?^Bogis asks his older brother Squelch for protection, and wants Bagaba put in his place.<br>[reward]
